Конфигурация/Reports/ДашбордПреподавателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ДашбордПреподавателя</Name>
			<Comment>Дашборд преподавателя по учебной группе: распределение θ, тепловая карта, рейтинг, активность.</Comment>
		</Properties>
	</Report>
</MetaDataObject>

Конфигурация/Catalogs/УчебныеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УчебныеГруппы</Name>
			<Comment>Учебные группы обучающихся</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодНабора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Reports/ДашбордПреподавателя/Forms/ФормаОтчёта/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("УчебнаяГруппа", УчебнаяГруппа);

	Если Не ЗначениеЗаполнено(УчебнаяГруппа) Тогда
		// Группа не передана (открытие из меню или при старте) - подбираем группу
		// текущего преподавателя, иначе первую учебную группу.
		УчебнаяГруппа = ГруппаПоУмолчанию();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(УчебнаяГруппа) Тогда

		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Нет ни одной учебной группы. Создайте группу в подсистеме Администрирование.'");
	КонецЕсли;
	
	ПараметрПериодОкончание = ТекущаяДатаСеанса();
	ПараметрПериодНачало    = ДобавитьМесяц(ПараметрПериодОкончание, -1);
	
	ТекстHTML = Отчеты.ДашбордПреподавателя.ПолучитьМакетКакСтроку(
		УчебнаяГруппа, 
		ПараметрПериодНачало, 
		ПараметрПериодОкончание);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработка кликов внутри дашборда. Кликабельные элементы HTML - якорные ссылки
// с атрибутами data-act (действие) и data-id (идентификатор объекта).
&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	Якорь = ДанныеСобытия.Anchor;
	Если Якорь = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Это наш управляющий клик - отменяем штатную навигацию поля HTML.
	СтандартнаяОбработка = Ложь;

	Действие = Якорь.getAttribute("data-act");
	ИД       = Якорь.getAttribute("data-id");

	Если Действие = "студент" ИЛИ Действие = "назначить" Тогда
		Если ЗначениеЗаполнено(ИД) Тогда
			ПараметрыФормы = Новый Структура("Пользователь", СтудентПоИД(ИД));
			ОткрытьФорму("Отчет.ДашбордОбучающегося.Форма.ФормаОтчёта", ПараметрыФормы);
		КонецЕсли;
	ИначеЕсли Действие = "тема" Тогда
		Если ЗначениеЗаполнено(ИД) Тогда
			ПоказатьЗначение(, ТемаПоИД(ИД));
		КонецЕсли;
	ИначеЕсли Действие = "период" Тогда
		Если ЗначениеЗаполнено(ИД) Тогда
			ОбновитьНаСервере(Число(ИД));
		КонецЕсли;
	ИначеЕсли Действие = "обновить" Тогда
		ОбновитьНаСервере();
	ИначеЕсли Действие = "библиотека" Тогда
		ОткрытьФорму("Отчет.ДашбордБиблиотеки.Форма.ФормаОтчёта");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УчебнаяГруппаПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Пересобирает HTML дашборда по текущей группе и периоду. Если задано ДнейПериода (> 0),
// период переустанавливается на последние N дней.
&НаСервере
Процедура ОбновитьНаСервере(Знач ДнейПериода = 0)

	Если ДнейПериода > 0 Тогда
		ПараметрПериодОкончание = ТекущаяДатаСеанса();
		ПараметрПериодНачало    = НачалоДня(ПараметрПериодОкончание) - (ДнейПериода - 1) * 86400;
	КонецЕсли;

	ТекстHTML = Отчеты.ДашбордПреподавателя.ПолучитьМакетКакСтроку(
		УчебнаяГруппа, ПараметрПериодНачало, ПараметрПериодОкончание);

КонецПроцедуры

// Группа по умолчанию: группа, где преподаватель - текущий пользователь; иначе первая.
&НаСервере
Функция ГруппаПоУмолчанию()

	Пользователь = ОбслуживаниеПользователейВызовСервера.ТекущийПользователь();
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 Группы.Ссылка КАК Ссылка
		|ИЗ Справочник.УчебныеГруппы КАК Группы
		|ГДЕ НЕ Группы.ПометкаУдаления И Группы.Преподаватель = &Преподаватель
		|УПОРЯДОЧИТЬ ПО Группы.Наименование");
	Запрос.УстановитьПараметр("Преподаватель", Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;

	ЗапросЛюбая = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 Группы.Ссылка КАК Ссылка
		|ИЗ Справочник.УчебныеГруппы КАК Группы
		|ГДЕ НЕ Группы.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО Группы.Наименование");
	ВыборкаЛюбая = ЗапросЛюбая.Выполнить().Выбрать();
	Если ВыборкаЛюбая.Следующий() Тогда
		Возврат ВыборкаЛюбая.Ссылка;
	КонецЕсли;

	Возврат Справочники.УчебныеГруппы.ПустаяСсылка();

КонецФункции

&НаСервереБезКонтекста
Функция СтудентПоИД(Знач ИД)
	Возврат Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
КонецФункции

&НаСервереБезКонтекста
Функция ТемаПоИД(Знач ИД)
	Возврат Справочники.Темы.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));
КонецФункции

#КонецОбласти
